---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.Luminosity
source: html/9db3e488-5610-f96e-7c39-c3b290a467e8.htm
---
# Autodesk.Revit.DB.Lighting.InitialLuminousIntensity.Luminosity Property

The luminosity value.

## Syntax (C#)
```csharp
public double Luminosity { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The luminosity value is not valid because it is not between 0 and 1e+30.